## End of Module Assessment 3

Your org implemented a Google Form for your Recweek, but it was not able to design it well enough to prevent ambiguous data entry.You are tasked to clean up a csv of fake, dirty data called **recweekdata.csv** (presumably exported from some spreadsheet).

In addition, you have a file named **studentprofiles.csv** which has first and last names plus the genders of the students.

The output of this assignment is to convert recweekdata.csv into usable data for statistics. Submit the following files through GitHub:
1. A cleaned recweekdata.csv called **cleanrecweekdata.csv**
2. This notebook, containing the code (properly commented) that you used to clean the data

Your solution **must use Pandas and possibly Numpy**.

Avoid using loops as much as you can. If I see loops where Pandas vectorization operations are more appropriate, you will receive deductions. 

Hint(s):
* if you need to apply scalar (regular single-value) functions on Pandas columns, use the Pandas Dataframe .apply(...) function

Clearly show your output similiar to what you see in this notebook. 

#### Required Statistics

1. How many people were born in each month?
2. How many people were born on each day?
3. How many people were born in each year?
4. How many people come from each course?
5. How many people per year level?
6. How many people have numbers from Globe (0917 or 0927) and Smart (0918)? *Note: it's up to you how to format this output*
7. How many Globe subscribers are: Male? Female?
8. How many Smart subscribers are: Male? Female?

In [2]:
# start of code; add as many cells as needed
import pandas as pd

In [3]:
def month_fix(month):
    if month == "Jan" or month == '1':
        return 'January'
    elif month == "Feb" or month == '2':
        return 'February' 
    elif month == "Mar" or month == '3':
        return 'March' 
    elif month == "Apr"  or month == '4':
        return 'April' 
    elif month == '5':
        return 'May' 
    elif month == "Jun" or month == '6':
        return 'June' 
    elif month == "Jul" or month == '7':
        return 'July' 
    elif month == "Aug" or month == '8':
        return 'August' 
    elif month ==  "Sep" or month == '9':
        return 'September' 
    elif month == "Oct" or month == '10':
        return 'October' 
    elif month ==  "Nov" or month == '11':
        return 'November' 
    elif month ==  "Dec" or month == '12':
        return 'December' 
    else:
        return month

In [4]:
def course_fix(course):
    if course=='BS CTM' or course=='Communication Technology' or course=='CTM':
        return 'BS Communications Technology'
    elif course=='BS ITE' or course=='IT Entrepreneurship' or course=='ITE':
	    return 'BS IT Entrepreneurship'
    elif course=='BS LM' or course == 'Legal Management' or course=='LM':
	    return 'BS Legal Management'
    elif course=='Management' or course == 'BS MGT' or course=='MGT':
	    return 'BS Management'
    elif course=='BS ME' or course=='Management Engineering' or course=='ME':
	    return 'BS Management Engineering'
    else:
        return course

In [5]:
def year_fix(year):
    if year==97:
        return 1997
    elif year==98:
        return 1998
    elif year==99:
        return 1999	
    elif year==00:
        return 2000
    else:
        return year

In [6]:
def number_fix(number):
    if number[0]=='+':
        number='0'+number[4:]
        return number
    elif number[0:2]=='63':
        number='0'+number[3:]
        return number
    elif number[0]=='0':
        return number
    else:
        number='0'+number
        return number

In [30]:
def carrier(mobileno):
    if mobileno[0:4]=='0918':
        return 'Smart'
    else:
        return 'Globe'

In [31]:
# the outputs below use the dataframe variable name recweek
recweek = pd.read_csv('recweekdata.csv')

In [32]:
# write code here
recweek.head()

,firstname,lastname,birthmonth,birthday,birthyear,course,yearlevel,phonenumber
0,name1,lastname1,11,26,1998,BS LM,2,+63 918 302 6210
1,name2,lastname2,May,26,2001,Management,4,927 212 6276
2,name3,lastname3,5,16,1997,BS CTM,1,+63 918 253 7017
3,name4,lastname4,Dec,9,97,BS ITE,3,918 714 4360
4,name5,lastname5,Sep,5,97,BS CTM,3,+63 927 462 1674

In [33]:
# write code here
recweek.tail()

,firstname,lastname,birthmonth,birthday,birthyear,course,yearlevel,phonenumber
2995,name2996,lastname2996,March,28,97,BS CTM,2,917 795 5051
2996,name2997,lastname2997,May,19,1998,LM,2,917 445 3378
2997,name2998,lastname2998,July,3,98,ITE,2,917 154 5694
2998,name2999,lastname2999,12,2,98,ME,3,927 497 8977
2999,name3000,lastname3000,Jul,13,1997,Legal Management,1,+63 918 719 7624

In [34]:
# write code here
recweek['birthmonth'] = recweek['birthmonth'].apply(lambda x: month_fix(x))
recweek

,firstname,lastname,birthmonth,birthday,birthyear,course,yearlevel,phonenumber
0,name1,lastname1,November,26,1998,BS LM,2,+63 918 302 6210
1,name2,lastname2,May,26,2001,Management,4,927 212 6276
2,name3,lastname3,May,16,1997,BS CTM,1,+63 918 253 7017
3,name4,lastname4,December,9,97,BS ITE,3,918 714 4360
4,name5,lastname5,September,5,97,BS CTM,3,+63 927 462 1674
...,...,...,...,...,...,...,...,...
2995,name2996,lastname2996,March,28,97,BS CTM,2,917 795 5051
2996,name2997,lastname2997,May,19,1998,LM,2,917 445 3378
2997,name2998,lastname2998,July,3,98,ITE,2,917 154 5694
2998,name2999,lastname2999,December,2,98,ME,3,927 497 8977
2999,name3000,lastname3000,July,13,1997,Legal Management,1,+63 918 719 7624

In [35]:
#birthyear cleaning
recweek['birthyear'] = recweek['birthyear'].apply(lambda x: year_fix(x))
recweek

,firstname,lastname,birthmonth,birthday,birthyear,course,yearlevel,phonenumber
0,name1,lastname1,November,26,1998,BS LM,2,+63 918 302 6210
1,name2,lastname2,May,26,2001,Management,4,927 212 6276
2,name3,lastname3,May,16,1997,BS CTM,1,+63 918 253 7017
3,name4,lastname4,December,9,1997,BS ITE,3,918 714 4360
4,name5,lastname5,September,5,1997,BS CTM,3,+63 927 462 1674
...,...,...,...,...,...,...,...,...
2995,name2996,lastname2996,March,28,1997,BS CTM,2,917 795 5051
2996,name2997,lastname2997,May,19,1998,LM,2,917 445 3378
2997,name2998,lastname2998,July,3,1998,ITE,2,917 154 5694
2998,name2999,lastname2999,December,2,1998,ME,3,927 497 8977
2999,name3000,lastname3000,July,13,1997,Legal Management,1,+63 918 719 7624

In [36]:
#course cleaning
recweek['course'] = recweek['course'].apply(lambda x: course_fix(x))
recweek

,firstname,lastname,birthmonth,birthday,birthyear,course,yearlevel,phonenumber
0,name1,lastname1,November,26,1998,BS Legal Management,2,+63 918 302 6210
1,name2,lastname2,May,26,2001,BS Management,4,927 212 6276
2,name3,lastname3,May,16,1997,BS Communications Technology,1,+63 918 253 7017
3,name4,lastname4,December,9,1997,BS IT Entrepreneurship,3,918 714 4360
4,name5,lastname5,September,5,1997,BS Communications Technology,3,+63 927 462 1674
...,...,...,...,...,...,...,...,...
2995,name2996,lastname2996,March,28,1997,BS Communications Technology,2,917 795 5051
2996,name2997,lastname2997,May,19,1998,BS Legal Management,2,917 445 3378
2997,name2998,lastname2998,July,3,1998,BS IT Entrepreneurship,2,917 154 5694
2998,name2999,lastname2999,December,2,1998,BS Management Engineering,3,927 497 8977
2999,name3000,lastname3000,July,13,1997,BS Legal Management,1,+63 918 719 7624

In [61]:
# mobile number cleaning

In [38]:
recweek['phonenumber'] = recweek['phonenumber'].apply(lambda x: number_fix(x))
recweek

,firstname,lastname,birthmonth,birthday,birthyear,course,yearlevel,phonenumber
0,name1,lastname1,November,26,1998,BS Legal Management,2,0918 302 6210
1,name2,lastname2,May,26,2001,BS Management,4,0927 212 6276
2,name3,lastname3,May,16,1997,BS Communications Technology,1,0918 253 7017
3,name4,lastname4,December,9,1997,BS IT Entrepreneurship,3,0918 714 4360
4,name5,lastname5,September,5,1997,BS Communications Technology,3,0927 462 1674
...,...,...,...,...,...,...,...,...
2995,name2996,lastname2996,March,28,1997,BS Communications Technology,2,0917 795 5051
2996,name2997,lastname2997,May,19,1998,BS Legal Management,2,0917 445 3378
2997,name2998,lastname2998,July,3,1998,BS IT Entrepreneurship,2,0917 154 5694
2998,name2999,lastname2999,December,2,1998,BS Management Engineering,3,0927 497 8977
2999,name3000,lastname3000,July,13,1997,BS Legal Management,1,0918 719 7624

In [39]:
# write code here
genderprofiles = pd.read_csv('studentprofiles.csv')
genderprofiles

     firstname      lastname  gender
0        name1     lastname1  Female
1        name2     lastname2  Female
2        name3     lastname3  Female
3        name4     lastname4    Male
4        name5     lastname5  Female
...        ...           ...     ...
2995  name2996  lastname2996  Female
2996  name2997  lastname2997    Male
2997  name2998  lastname2998  Female
2998  name2999  lastname2999    Male
2999  name3000  lastname3000    Male

[3000 rows x 3 columns]

In [40]:
# write code here
# Merged recweek and studentprofiles.csv 
final_recweek= genderprofiles.merge(recweek)
final_recweek

,firstname,lastname,gender,birthmonth,birthday,birthyear,course,yearlevel,phonenumber
0,name1,lastname1,Female,November,26,1998,BS Legal Management,2,0918 302 6210
1,name2,lastname2,Female,May,26,2001,BS Management,4,0927 212 6276
2,name3,lastname3,Female,May,16,1997,BS Communications Technology,1,0918 253 7017
3,name4,lastname4,Male,December,9,1997,BS IT Entrepreneurship,3,0918 714 4360
4,name5,lastname5,Female,September,5,1997,BS Communications Technology,3,0927 462 1674
...,...,...,...,...,...,...,...,...,...
2995,name2996,lastname2996,Female,March,28,1997,BS Communications Technology,2,0917 795 5051
2996,name2997,lastname2997,Male,May,19,1998,BS Legal Management,2,0917 445 3378
2997,name2998,lastname2998,Female,July,3,1998,BS IT Entrepreneurship,2,0917 154 5694
2998,name2999,lastname2999,Male,December,2,1998,BS Management Engineering,3,0927 497 8977
2999,name3000,lastname3000,Male,July,13,1997,BS Legal Management,1,0918 719 7624

In [62]:
# export to csv
# compare with cleanrecweekdata
final_recweek.to_csv('cleanrecweekdata.csv')

In [42]:
# Use ls (Mac) or dir (Windows) cleanrecweekdata.csv
# choose appropriate command
# !dir cleanrecweekdata.csv
# or
# !ls cleanrecweekdata.csv

In [63]:
# write code here
!dir cleanrecweekdata.csv

Volume in drive C is Windows
 Volume Serial Number is 7015-88ED

 Directory of c:\Users\LB\Downloads

11/08/2020  02:00 PM           260,942 cleanrecweekdata.csv
               1 File(s)        260,942 bytes
               0 Dir(s)  451,183,198,208 bytes free

#### Get statistics

In [44]:
# People per Birthmonth sorted by calendar numeric month

In [45]:
# Write code here
# shout out to https://stackoverflow.com/questions/10373660/converting-a-pandas-groupby-output-from-series-to-dataframe#comment65222287_10374456 actually saved my life haha
birthmonth_df=final_recweek.groupby(["birthmonth"]).size().to_frame(name = 'count').copy()
months=["January","February","March","April","May","June","July","August","September","October","November","December"]
birthmonth_df = birthmonth_df.reindex(months)
birthmonth_df.reset_index(inplace=True)
birthmonth_df

   birthmonth  count
0     January    270
1    February    232
2       March    246
3       April    267
4         May    273
5        June    259
6        July    249
7      August    241
8   September    232
9     October    178
10   November    277
11   December    276

In [46]:
# same day
# sort by calendar day

In [47]:
# write code here
final_recweek.groupby(["birthday"]).size().to_frame(name = 'count').reset_index()

    birthday  count
0          1    112
1          2    106
2          3     90
3          4    110
4          5    100
5          6     99
6          7     88
7          8    111
8          9     98
9         10    111
10        11    105
11        12     98
12        13    119
13        14    102
14        15    121
15        16    115
16        17    116
17        18    107
18        19    113
19        20     91
20        21    123
21        22    103
22        23    116
23        24    108
24        25    116
25        26    116
26        27    102
27        28    104

In [48]:
# same year
# sort accordingly

In [49]:
# write code here
final_recweek.groupby(["birthyear"]).size().to_frame(name = 'count').reset_index()

   birthyear  count
0       1997    756
1       1998    746
2       1999    756
3       2000    380
4       2001    362

In [50]:
# same year level
# sort accordingly

In [51]:
# write code here
final_recweek.groupby(["yearlevel"]).size().to_frame(name = 'count').reset_index()

   yearlevel  count
0          1    760
1          2    791
2          3    751
3          4    698

In [52]:
# same course
# sorting does not matter

In [53]:
# write code here
final_recweek.groupby(["course"]).size().to_frame(name = 'count').reset_index()

                                    course  count
0             BS Communications Technology    394
1                   BS IT Entrepreneurship    389
2                      BS Legal Management    585
3                            BS Management    629
4                BS Management Engineering    607
5                Communications Technology    195
6  Information Technology Entrepreneurship    201

In [57]:
# write code here
final_recweek_with_carrier = final_recweek.copy()
final_recweek_with_carrier["Carrier"]= recweek['phonenumber'].apply(lambda x: carrier(x))
final_recweek_with_carrier

,firstname,lastname,gender,birthmonth,birthday,birthyear,course,yearlevel,phonenumber,Carrier
0,name1,lastname1,Female,November,26,1998,BS Legal Management,2,0918 302 6210,Smart
1,name2,lastname2,Female,May,26,2001,BS Management,4,0927 212 6276,Globe
2,name3,lastname3,Female,May,16,1997,BS Communications Technology,1,0918 253 7017,Smart
3,name4,lastname4,Male,December,9,1997,BS IT Entrepreneurship,3,0918 714 4360,Smart
4,name5,lastname5,Female,September,5,1997,BS Communications Technology,3,0927 462 1674,Globe
...,...,...,...,...,...,...,...,...,...,...
2995,name2996,lastname2996,Female,March,28,1997,BS Communications Technology,2,0917 795 5051,Globe
2996,name2997,lastname2997,Male,May,19,1998,BS Legal Management,2,0917 445 3378,Globe
2997,name2998,lastname2998,Female,July,3,1998,BS IT Entrepreneurship,2,0917 154 5694,Globe
2998,name2999,lastname2999,Male,December,2,1998,BS Management Engineering,3,0927 497 8977,Globe
2999,name3000,lastname3000,Male,July,13,1997,BS Legal Management,1,0918 719 7624,Smart

In [60]:
# Carrier counts
final_recweek_with_carrier.groupby(["Carrier"]).size().to_frame(name = 'count').reset_index()
# Carrier count with gender
final_recweek_with_carrier.groupby(["Carrier","gender"]).size().to_frame(name = 'count').reset_index()

  Carrier  gender  count
0   Globe  Female    984
1   Globe    Male   1061
2   Smart  Female    494
3   Smart    Male    461